<template>
    <h2>مقدمه</h2>
    <p>
        پرسشنامه‌ی پیش‌رو، شامل ۴۹ گویه است و سازمان شما را در ۷ حوزه کلیدی: استراتژی و چشم انداز، فرآیندها، سیستم های تجاری، کارکنان، مشتریان و تامین کنندگان و مردم، محیط و ارزش‌ها‌و‌فرهنگ‌ها بررسی می‌کند و بخش‌های مشکل دار سازمان را در هر یک از محورهای ذکر شده به شما ارائه می‌دهد. لطفا پرسشنامه‌ها را با دقت تکمیل کنید و با در نظر گرفتن شرایط کسب و کار خویش به سوالات امتیاز دهید. همچنین به منظور تعریف پروژه‌های بهبود، عارضه یابی دقیق و عارضه یابی جامع، می‌توانید با کارشناسان خبره ما تماس بگیرید.
    </p>
    <a href="/diagnostics/2/step/1" class="btn btn-primary">مرحله بعد</a>
</template>
